wisteria-1c/Конфигурация/Documents/НачисленияПоКредитамИЗаймам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НачисленияПоКредитамИЗаймам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Запасы</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоКредитамИЗаймам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачисленияПоКредитамИЗаймам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСуммГрафикаКредитовИЗаймов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКредитаЗайма</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ДоговорКредитаИЗайма</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаРасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ТипыСуммГрафикаКредитовИЗаймов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСуммГрафикаКредитовИЗаймов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыОперацийНачисленияПоКредитамИЗаймам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийНачисленияПоКредитамИЗаймам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачисленияПоЗаймамСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленияПоКредитам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Documents/НачисленияПоКредитамИЗаймам/Forms/ФормаВводаРасходаИзКассы/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет таблицу договоров данными из ТЧ Начисления документа НачисленияПоКредитамИЗаймам.
//
&НаСервере
Процедура ЗаполнитьТаблицуДоговоров()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияПоКредитамИЗаймамНачисления.Сотрудник,
		|	НачисленияПоКредитамИЗаймамНачисления.Контрагент,
		|	НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма,
		|	НачисленияПоКредитамИЗаймамНачисления.ВалютаРасчетов,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = &ТипСуммыПроценты
		|				ТОГДА НачисленияПоКредитамИЗаймамНачисления.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Проценты,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = &ТипСуммыПроценты
		|				ТОГДА 0
		|			ИНАЧЕ НачисленияПоКредитамИЗаймамНачисления.Сумма
		|		КОНЕЦ) КАК Комиссия,
		|	ИСТИНА КАК Отметка
		|ИЗ
		|	Документ.НачисленияПоКредитамИЗаймам.Начисления КАК НачисленияПоКредитамИЗаймамНачисления
		|ГДЕ
		|	НачисленияПоКредитамИЗаймамНачисления.Ссылка = &ДокументНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма,
		|	НачисленияПоКредитамИЗаймамНачисления.ВалютаРасчетов,
		|	НачисленияПоКредитамИЗаймамНачисления.Контрагент,
		|	НачисленияПоКредитамИЗаймамНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("ДокументНачисления", ДокументНачисления);
	Запрос.УстановитьПараметр("ТипСуммыПроценты", Перечисления.ТипыСуммГрафикаКредитовИЗаймов.Проценты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДоговорыКредитаИЗайма.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументНачисления = Параметры.ДокументНачисления;
	Если Не ЗначениеЗаполнено(ДокументНачисления) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ДокументНачисления.ВидОперации = Перечисления.ВидыОперацийНачисленияПоКредитамИЗаймам.НачисленияПоКредитам Тогда
		Заголовок = Заголовок + ДокументНачисления;
		
		Элементы.ГруппаКнопкиРасходаДС.Видимость = Истина;
		Элементы.ФормаВвестиРасходСоСчета.КнопкаПоУмолчанию = Истина;
		Элементы.ФормаВвестиРасходСоСчета.Важность = ВажностьКнопки.Главная;
		
		Элементы.ГруппаКнопкиПоступленияДС.Видимость = Ложь;
		Элементы.ФормаВвестиПоступлениеВКассу.КнопкаПоУмолчанию = Ложь;
		Элементы.ФормаВвестиПоступлениеНаСчет.Важность = ВажностьКнопки.Обычная;
	Иначе
		Заголовок = Заголовок + ДокументНачисления;
		
		Элементы.ГруппаКнопкиРасходаДС.Видимость = Ложь;
		Элементы.ФормаВвестиРасходСоСчета.КнопкаПоУмолчанию = Ложь;
		Элементы.ФормаВвестиРасходСоСчета.Важность = ВажностьКнопки.Обычная;
		
		Элементы.ГруппаКнопкиПоступленияДС.Видимость = Истина;
		Элементы.ФормаВвестиПоступлениеВКассу.КнопкаПоУмолчанию = Истина;
		Элементы.ФормаВвестиПоступлениеНаСчет.Важность = ВажностьКнопки.Главная;
	КонецЕсли;
	
	ЗаполнитьТаблицуДоговоров();

	УстановитьДоступностьКоманд();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДоговорыКредитаИЗаймаОтметкаПриИзменении(Элемент)
	
	УстановитьДоступностьКоманд();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКоманд

// Процедура - обработчик команды ВвестиФактическийПлатеж.
//
&НаКлиенте
Процедура ВвестиФактическийПлатеж(ВидДокумента)
	
	ЕстьОтметка = Ложь;
	Для Каждого ТекущаяСтрока Из ДоговорыКредитаИЗайма Цикл
		Если ТекущаяСтрока.Отметка Тогда
			ЕстьОтметка = Истина;
			
			ПараметрыКредитовИЗаймов = Новый Структура("Документ, ДоговорКредитаЗайма, ВалютаРасчетов, Сотрудник, Контрагент", 
				ДокументНачисления, 
				ТекущаяСтрока.ДоговорКредитаЗайма,
				ТекущаяСтрока.ВалютаРасчетов,
				ТекущаяСтрока.Сотрудник,
				ТекущаяСтрока.Контрагент);
			ПараметрыЗаполнения = Новый Структура("Основание", ПараметрыКредитовИЗаймов);
			
			ОткрытьФорму("Документ."+ВидДокумента+".ФормаОбъекта", ПараметрыЗаполнения, , ТекущаяСтрока.ДоговорКредитаЗайма);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьОтметка Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Не отмечено ни одной строки. Установите флаги в первой колонке и снова нажмите кнопку.'"));
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды ВвестиРасходИзКассы.
//
&НаКлиенте
Процедура ВвестиРасходИзКассы(Команда)
	
	ВвестиФактическийПлатеж("РасходИзКассы");
	Закрыть();
	
КонецПроцедуры

// Процедура - обработчик команды ВвестиПриходВКассу.
//
&НаКлиенте
Процедура ВвестиПриходВКассу(Команда)
	
	ВвестиФактическийПлатеж("ПоступлениеВКассу");
	Закрыть();
	
КонецПроцедуры

// Процедура - обработчик команды ВвестиРасходСоСчета.
//
&НаКлиенте
Процедура ВвестиРасходСоСчета(Команда)
	
	ВвестиФактическийПлатеж("РасходСоСчета");
	Закрыть();
	
КонецПроцедуры

// Процедура - обработчик команды ВвестиПоступлениеНаСчет.
//
&НаКлиенте
Процедура ВвестиПоступлениеНаСчет(Команда)
	
	ВвестиФактическийПлатеж("ПоступлениеНаСчет");
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьКоманд()

	ЕстьОтметка = Ложь;
	Для Каждого ТекущаяСтрока Из ДоговорыКредитаИЗайма Цикл
		Если ТекущаяСтрока.Отметка Тогда
			ЕстьОтметка = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ФормаВвестиРасходИзКассы.Доступность = ЕстьОтметка;
	Элементы.ФормаВвестиРасходСоСчета.Доступность = ЕстьОтметка;
	Элементы.ФормаВвестиПоступлениеВКассу.Доступность = ЕстьОтметка;
	Элементы.ФормаВвестиПоступлениеНаСчет.Доступность = ЕстьОтметка;
	
КонецПроцедуры

#КонецОбласти
